Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Webcomic_Star Chasing Boys (KO>EN).tmx
Source language: ko
Languages: en

source: 답글 숨기기
en: Hide Replies

source: 안 그래?
en: don’t you think?

source: 끄아...
en: ack

source: 솔아…
en: soule...

source: 너무 오래 밖에 있진 말자.
en: let’s not be gone for too long, all right?

source: 어째서 꿈이랑 똑같은 거야?!
en: how...?! this is exactly like my dream!!

source: 이제 좀 쉬자.
en: let’s get some rest.

source: 다를 거야.
en: in every way.

source: 괜찮습니다.
en: no, I’m good.

source: 제 3 화
en: Episode 3

source: 이젠 만만하지 않을걸?
en: I bet I’m no longer an easy target!

source: 오면서 보는데 이 날씨에도 기자들이 진을 쳤더라.
en: did you see the reporters camping around the hospital despite the weather?

source: 형은 안전한 곳으로 피해!
en: you should be somewhere safe.

source: 뭘 어떻게 한 건지 모르겠지만
en: I don’t know what that was...

source: 어..
en: what...

source: 왜 그래?
en: what’s wrong?

source: 차량 지원도 없다.
en: ...I’m taking away your company car.

source: 으아악!!!
en: ahhh!

source: 투둑
en: drop

source: 빠른 포기
en: whatever.

source: 어라? 안 먹어? ㅠㅠ
en: huh? you don’t want it? :(

source: ...형?
en: eugene...?

source: 어디서 갑자기 생겨난 거야?
en: and where did they come from?

source: 스으윽...
en: turn

source: 예.{j}보여주지 않았습니까.
en: I am sure. you have proved yourselves...{j}

source: 원래는 투어 마치고 좀 쉬실 텐데...
en: I thought she would take a break after the tour.

source: …그렇군요.
en: I see.

source: 지금까지처럼
en: just as we’ve done before.

source: 싫어요
en: Dislike

source: 아~ 아냐 아냐 얘가 말 걸었어.
en: oh, nothing! I was talking to this plant.

source: 우리 회사도 그중 하나고.
en: they invested in UVIC too.

source: 꺄아악
en: kyahhh

source: 전 읽었는데요...
en: but I did.

source: 타호로 이 계약에 서명한다.
en: this is taho signing the contract.

source: 비켄 형!!
en: viken!

source: 건강한 신체에서 건강한 정신이 만들어진다.
en: they say “a sound mind in a sound body.”

source: 여기 계신 매니저분과 어머님도
en: also, your manager here and your mother...

source: 그럼 제 발로 걸어들어 올 거야.
en: then, he’ll gladly take the bait...

source: 응! 어떤 마법일지 궁금하다
en: yup! let’s see what kind of magic they use.

source: PD님...!
en: hello, sir!

source: 본 무대에서 어떻게 하나 두고보자
en: let’s see how you do on the actual stage.

source: 이 형이 진짜....
en: this guy...

source: 아무렇지 않아
en: I feel totally fine.

source: 이 목소린 아비스?!
en: isn’t that avys?!

source: 저기 봐!!
en: look!

source: 착!
en: step

source: 좋았어!
en: yes!

source: DK형 오면 우리 언제까지 여기 있어야 되는지 물어보자.
en: let’s ask dk how long we need to stay here when he comes.

source: 비켄!!!
en: viken!!!

source: 그런데 그게 뭐?!
en: so what?!

source: 데뷔조에 들어가는 건 성공했는데 마법은 못쓰니까 불안했나 봐...
en: he made it to the debut candidate list, but his lack of magical powers must’ve made him feel anxious.

source: 으아아아
en: aaaah

source: 헉
en: huff

source: 컥,크극
en: a-ack

source: 아이고~
en: my, my...

source: 사고 난 거 사과 드릴 겸...{j}누구신지 모르지만
en: I resumed my livestream to apologize for the earlier incident...{j}

source: 기사원문
en: Read More

source: 으아아!!{j}형!!!
en: ahhh! help!{j}

source: 그래도 리허설 한 번만 들어갈게요.
en: but can we squeeze in one round of rehearsals?

source: 내 친구도 그 중 하나였어.
en: my friend was one of them.

source: 간 떨어지는 줄 알았잖아!!
en: you scared me!

source: 바빠질 거라는 대표님의 말은 사실이었다.
en: the ceo was right about us rising to stardom.

source: 아까처럼 마법에 실패 했다간..
en: if you fail to use your magic, just like you did earlier...

source: 긍지 높으신 가주께서 이미 허락하신 걸 취소 하시겠다는 건가요?
en: are you, the honorable head of the clan, trying to take back what you have already approved?

source: 열심히 해볼게요.
en: I’ll try my best.

source: 계속 당해야 하지?
en: ...to keep going through such pain?

source: 비켄 멈춰!!
en: stop, viken!

source: 휘릭
en: whish

source: 맨날 구박하다 저러니까 적응 안 되네
en: it feels awkward to hear his compliments. he only ever treats us like problems.

source: _x0008_콰득
en: crack

source: 응급의료센터
en: Emergency Room

source: 아, 타호야.
en: hey, taho.

source: 만족스러우셨나요?
en: how did you like it?

source: 더 자세한 설명은 제가 드릴 수 있는 게 아닙니다.
en: I am afraid I cannot elaborate further.

source: 강력한 힘을 쓴 만큼 그 대가도 큰 거야!
en: he’s experiencing great consequences for using great power!

source: 다른 멤버들은 괜찮은가?
en: are the other members okay?

source: 그래~비켄 형이 유진 형 데리고 돌아오면 우리 계획 솔직하게 말하자.
en: all right, then! let’s share our plan with eugene when he and viken come back.

source: 우리가 썼던 마법.
en: I’m talking about the magic we used.

source: 우르르
en: rumble

source: 제 9 화
en: Episode 9

source: 소환수를 불러올 수 있는 거 같고
en: ...that can use his power on his behalf.

source: 그렇게 급한 일이었어?
en: was it that important?

source: ...세계?
en: your... universe?

source: 산림대학교성심병원
en: Sallim University Sacred Heart Hospital

source: 정신이 좀 들어?
en: can you hear me?

source: 타호야~ 다친데 보여줘~!
en: taho! show me your wound!!

source: 꺄아아악
en: ahhhhh

source: 솔이 형!!!
en: soule!!!

source: 딱
en: snap

source: 왜 그러죠?{j}이 정도는 엄마로서 당연한 요구 아닌가요?
en: what’s the problem? isn’t this a reasonable demand for a mother to make?{j}

source: 너희들 덕분에 힘을 꽤 써버려서 좀 쉬어야겠어.
en: I need to recover from using all that power for you.

source: 아~!!
en: oh!

source: 어딜!
en: stop!

source: 휘익
en: swing

source: 저기 그 말씀은…
en: by that you mean...

source: 그런데 그렇게 쓰러지면 병원에서도 할 수 있는 게 별로 없어.
en: when he collapses like that, there’s little that even the doctors can do.

source: 내가 마법을 쓸 줄 알았더라면
en: if only I knew how to use magic.

source: 아니오.
en: no.

source: 무슨 소리,
en: what are you talking about--

source: ...나도 동의해.
en: I agree, soule.

source: 정신이 들어?
en: can you hear me?

source: 엄청 화려해...
en: so epic...

source: 솔이형이랑 타호가 알려줄거야.
en: let soule and taho explain everything to you.

source: 찾아가서 네 안에 담아 준 걸 전해
en: go give him what I’ve given you.

source: 싸아아...
en: crickets

source: 네가 그 힘을 가질 자격이 되는지
en: I need to see for myself...

source: 됐다!!
en: it worked!

source: 그게…
en: well...

source: 막 날아다녀?{j}고양이가?
en: and it flies, too?{j}

source: 타들어가는 것 같아
en: ...feels like it’s burning.

source: 너희들은?{j}다들 괜찮은 거 맞지?
en: what about you guys? is everyone all right?{j}

source: 오 됐다!!
en: whoa, it worked!

source: 곧 있을 컴백 무대에서 확인 하실 수 있을 겁니다.
en: you will see it yourself at their comeback performance.

source: 이게 진짜면...내가...
en: if it is, then I can...

source: 저 날개는 뭐야?{j}어떻게 저런 마법을 쓸 수 있지?
en: what’s with those wings? how’s he able to use such magic?{j}

source: 그때 네가 쓴 마법 능력이 어떤 힘인지 알고 있나?
en: do you have any clue what kind of magic you used that day?

source: 원인 불명의 현상으로 지구 곳곳에
en: ...an unknown phenomenon...

source: 꺄악!!
en: kyaaa!

source: 이대로 가다간 전부..!
en: this has to stop!

source: 얼른 원래대로 돌아가.
en: now, return home.

source: 그전에 한 가지 묻죠.
en: before that, let me ask you one thing.

source: 짝!
en: clap

source: 그나저나 앞으로 얜 어떻게 하지?
en: by the way, what should we do with this cat?

source: 우리 정말..버리는 카드구나
en: I guess... they’ve really given up on us.

source: 우리 사정도 여유롭진 않잖아.
en: we’ve got work to do, you know that.

source: 아이들 곁에서 떨어지면 안 되겠어
en: I should stay by the boys’ sides.

source: 어차피 열심히 하려고 했어!
en: I was going to try hard anyway!

source: 이 건 뭐야?!
en: what is this thing?!

source: 아아. 그래도 눈이랑 입은 깨끗하네. 병원 지금 가려고?
en: it looks fine otherwise. its eyes and mouth are squeaky-clean. are you going to take it to the hospital right away?

source: 매니저도 1명으로 줄었다.
en: you only have one manager now.

source: 그래도 신경쓰이니까...
en: but this is going to keep bothering me.

source: 보호자분은 여기서 기다려주세요!
en: family members must wait here!

source: 먼저 치료를 받으시죠.
en: I’d suggest you receive treatment first.

source: 아픈데 없대.
en: it’s perfectly healthy.

source: 응?{j}무슨 소리,
en: huh? what are you talking-?{j}

source: 진영이 방송 알림이구나.
en: it’s a notification for jinyeong’s live streaming.

source: 아오!
en: ugh!

source: 롯씨도 좀 전에 도착한 거 같던데.
en: it seems like lote arrived a few minutes ago.

source: 나 좀 태워줘!!
en: give me a ride!

source: 아비스, 아까 내 부상에 관한 얘기 말인데..
en: avys, about my injury earlier...

source: 어딜!{j}거기 꼼짝 말고 있어요!
en: don’t even think about it! stay right where you are!{j}

source: 다시 한번 내 도움이 필요할 정도로 말이지.
en: awful enough that you needed my help again.

source: 그렇다면 그날 당신이 어디까지 할 수 있을지 두고 보지.
en: ...how far you’re willing to go on our d-day.

source: 예!
en: yes!

source: 난...
en: I--

source: 안녕하세요 !!
en: Hello!

source: 그리고 부가주님의 지원을 받을 수 있다면 더 확실히....
en: it’d be even better if we can get support from madam assistant head--

source: 이유를 모르겠네
en: I don’t understand.

source: 네놈들 소굴로 아이들만 보낼 순 없지!
en: there’s no way we’re sending the boys to your little hideout all by themselves!

source: 솔로 파트 끝날 때까지 너희들이 제대로 받쳐 줄 거라는 거.
en: that you’ll support me throughout my solo part.

source: 아니에요.{j}제가 따로 찾아갈게요.
en: it’s okay. I’ll drop by later.{j}

source: 거기에 더해서 테러범들의 난입 후에는
en: not only that, you have shown even stronger magic...

source: 형도 발현된 거야?!{j}우와!!
en: whoa!! you manifested magic, too?!{j}

source: 물음표 살인마
en: QuestionMarkKiller

source: 팍-
en: thump

source: 끼익
en: yank

source: 그렇게 노력하더니 축하한다!
en: I knew your hard work would pay off. Congratulations!

source: 불백
en: BBQ

source: 타호오빠?!
en: taho?

source: 물 들어올 때 노 저어야 하지 않겠냐.
en: we can’t miss this opportunity.

source: 난 그걸로는 만족 못 해. 형도 그렇지 않아?
en: I can’t be happy with that, can you?

source: 근원의 마법에 대해 알고 싶다면 그 책에서 찾아봐.
en: if you want to learn about the origin, look it up in that book.

source: 얼른 동선 맞춰야 돼.
en: we need to coordinate our dance moves. timing matters.

source: 으아아아악!!
en: aaahhh!!!

source: 쉬이익
en: whish

source: 우린 마법도 못쓰는데 왜..!?
en: we can’t even use magic!

source: 이유를 모르는 호의는 달갑지 않거든요.
en: ...so I don’t appreciate receiving favors for no reason.

source: 아직 욱신거리기는 하지만 좀 전보다 훨씬 나아요.
en: it still aches, but I feel much better than earlier.

source: 몰래 시도했던 연습생들 많았잖아.
en: ...after hearing it’d help them manifest their magic.

source: 아 그리고!
en: oh! also,

source: 솔..
en: soule...

source: 쯧
en: tsk.

source: X발...
en: goddammit...

source: 어쨌든 열심히 해보자고!
en: why don’t we give it a try?

source: 큭
en: ugh!

source: 아...{j}그건…
en: oh... about that...{j}

source: 이걸로 확실해졌다.
en: this just proved it.

source: 타다닷-
en: dash

source: 말씀하시는 유토피아를 저희가 어떻게 만들 수 있는지 이해가 안 돼요.
en: I don’t understand how we’re supposed to create the utopia you so call.

source: 오늘 약속한...
en: as I promised, today I will...

source: 아니 괜찮아.
en: oh, no. I’m fine.

source: 세계적으로 유명한 마법 가수 아들이 여태 마법도 못 쓰는 반푼이일 줄이야.
en: little did I know that the son of a world-famous magic singer would turn out to be worthless, with no magical abilities.

source: 저러다가는 휘말릴 거야!
en: they could get caught up in the fight!

source: 어...?
en: what...?!

source: 더더욱 강한 마법이 필요합니다!
en: ...we need ever more powerful magic!

source: 커억
en: argh!

source: 제 11 화
en: Episode 11

source: 아직 새벽이야.
en: it’s still early.

source: 어떠십니까?
en: what do you think?

source: 그래도 마법 사용 하는 거 너무 쉽게 생각하지 말자.
en: still, we shouldn’t take the use of magic lightly.

source: 정신이 드셨군요.
en: you are awake.

source: 음..{j}이상하네.
en: hm... this sure is strange.{j}

source: 타이밍이 중요하다고.
en: timing matters.

source: 토닥 토닥
en: 삭제

source: 나머지 녀석들은 필요 없으니
en: the rest of them are useless,

source: 지내시기 불편한 점은 없으셨나요?
en: is there anything you need during your stay?

source: 진명(眞名)이란다.
en: ...will unveil your true name.

source: 반짝
en: sparkle

source: 많이 아프죠?!
en: that must hurt!

source: 기운을 불어 넣어 줘야지!
en: it might cheer him up!

source: 바,,방금 뭐가 보인거야?
en: wh-what did I just see?

source: 피!!{j}피 나잖아!
en: y-you’re bleeding!{j}

source: 많은 희생도 감수했습니다.
en: they have also made great sacrifices.

source: 운명의 소년이랬나?
en: they called us the boys of destiny or something.

source: 왜지?
en: why’s that?

source: 콰당
en: crash

source: 끝나는 건가?
en: how it ends?

source: 내겐 너무나 소중한 사람들이니까
en: ...are people I deeply care about.

source: 이렇게...{j}끝나는 건가?
en: is this... the end for us?{j}

source: 아… 예.{j}괜찮습니다.
en: oh... we’re fine.{j}

source: 빙글
en: twirl

source: 얘 엄청 귀엽다.
en: you’re adorable.

source: 꽤나 끔찍했을 거야.
en: it must’ve been awful.

source: 오래 기다리셨죠?
en: thank you for your patience.

source: 형들을 도우려면 마법서가 필요한데…
en: I need the spellbook to help everyone...

source: 마법도 못하면서 무슨 리드보컬이고 리드댄서야?!
en: no magic, no lead vocalist and no lead dancer.

source: 아직 제대로 마법을 못 다루잖아
en: we can’t control our magic perfectly.

source: 팬이에요 ㅠ.,ㅠ
en: I’m a fan! <3

source: 혹시 그 고양이가 얘기하던 거랑 비슷한 건가??
en: is it related to what the cat told us the other day?

source: 아니오.{j}통증의 잔재가 남아 분명 괴로우실 겁니다.
en: no, I am sure you are in pain due to the lingering effects.{j}

source: 가
en: A

source: 알림
en: Notifications

source: 응!{j}궁금하다.
en: yup! let’s see how they do.{j}

source: 그 난리 덕에 좀 쉬려고 했더니 이렇게 늦게까지 사람을 굴리냐
en: I got my hopes up about getting some rest after what we went through... but instead, they ran us into the ground.

source: 너희들이 그렇게까지 해서 날 띄워 줄 필요가 있을까?
en: but is it really necessary for you to take the risk just to put me in the center of everything?

source: 매니저 일만 해왔다면서 온몸이 흉터로 덮여있잖아.
en: it’s pretty unusual for a manager to have so many scars...

source: 오늘 또 라이브 하는 거?{j}쉬는 게 좋을 텐데...
en: is he singing live again? I think he needs a break.{j}

source: 몸 상태 괜찮은 거면…
en: if you’re feeling better...

source: 아 ㅅㅂ 시간 버렸네.
en: ugh, what waste of time.

source: 저로서는 한 번쯤은 의심해 볼 만하다고 생각합니다.
en: I think it’s reasonable to be skeptical.

source: 성인 전에 진작 마법 발현이 됐어야 하는건데..{j}쯧
en: your magical abilities should’ve manifested before you turned adults... tsk.{j}

source: 어머니!{j}저 유빅 엔터에 스카우트됐어요.
en: mom! I got an offer from uvic entertainment.{j}

source: 가자!!{j}모두를 구하러!!
en: let’s go and save everyone!!{j}

source: 저날 마법 첨 써본 거 맞음?
en: you sure they never used magic before?

source: 괜찮아?!
en: are you okay?

source: 다짜고짜 이런 곳으로 날려 보내다니!
en: throwing us down here!

source: 근데 매니저 형..
en: by the way,

source: 이게 대체 뭐야!!!
en: what on earth is this?!

source: 힘을 빌려줄게 맘껏 쓰렴.
en: we will lend you our power. use it as you please.

source: 어떤 마법을 어디까지 발휘할 수 있을지 모를
en: such classes were important, especially to children with untapped potential,

source: 모두 잘 쉬셨습니까?
en: good morning, everyone.

source: 형 그렇게 나가서 다들 걱정하고 있다고
en: everyone’s worried after you stormed out like that.

source: 허락 하겠습니까?
en: do you consent to my request?

source: 에이 내가 무슨....
en: nah, what am I thinking?

source: 헤헤
en: hehe

source: 사람들 대피도 끝났고 조금만 더 힘내자!
en: everyone’s evacuated now. hang in there!

source: 난 엄청 화려한 박스가 보이던데?
en: I saw an elaborate box.

source: 이 세계는 다시 한번 새로운 진보를 이루어 낼 것이라는 것을!
en: ...that this world will once again make new progress!

source: 나 때문이야 내가 넘어지지만 않았어도..
en: it’s all my fault. if only I didn’t trip over...

source: 디케이형!!
en: DK!

source: 너희들 이런 무대에 올라가 본 적도 없잖아.
en: you’ve never performed on a stage like this before.

source: 눈치...
en: glance

source: 핏-
en: slash

source: 아- 빨리 줘요.
en: just give me your hand!

source: 그때처럼..{j}또
en: again, just like in the past...{j}

source: 응!
en: yup!

source: 아픈데 없대.{j}유기된 거 아닐까 하던데?{j}아님 사고로 집을 나온 거던가.
en: it’s perfectly healthy. they suspect it was abandoned or went missing after accidentally leaving its home.{j}

source: 이상한 고양이가 말했던 근원의 마법이라는 게 뭔지도 알아봐야 해.
en: and find out what “the origin” that the cat mentioned is all about.

source: 좋아 좋아
en: what a great news!

source: ODBC 출연자 대기실
en: odbc green room

source: 어...
en: yeah...

source: 쫄지 마.{j}네가 더 잘생겼어.
en: “keep your head up. you’re more good-looking than them.”{j}

source: 마법을 사용한 만큼 대가를 치른다
en: you face the consequences corresponding to the magic you used.

source: 뿔이 검으로 바뀌었어?!!
en: his antlers turned into a sword!

source: 비켄!!
en: viken!

source: 오 좋다.
en: fried chicken!

source: 좋아!{j}한 명 더 기절!
en: and there goes another one!{j}

source: 타다다닷
en: rush

source: 디케이 형의 뭘 믿고 마법을 배우겠다는 거야?
en: do you even trust this guy?

source: 어제만 해도 어디로 끌려가는 건가 불안했는데…
en: I was worried if we were being kidnapped just last night...

source: 그럼 마지막 질문입니다.
en: my last question for you.

source: 꺄아아~
en: aaahhhh

source: 어?{j}유진씨?
en: huh? mr. eugene?{j}

source: 어?!{j}형!{j}정신이 들어?
en: huh?! eugene, you’re awake!!{j}{j}

source: 포션의 효과에는 개인차가 있습니다.{j}좀 더 기다려 보고…
en: the potion works differently on people. wait for a few more--{j}

source: 마법은 모두에게 공평하게 발현 되지만
en: magic manifests to everyone equally...

source: 너희 세계의 규칙때문에 얻은 통증까지 내 탓으로 돌리면 억울하다고.
en: don’t blame me for the pain you got because of the rules in your world.

source: 이런 병원에서 어떤 치료를 할 수 있죠?
en: ...and what treatment does this hospital offer?

source: 음향팀!{j}대답 안해?!
en: answer me, audio team!{j}

source: 드는 생각이 고작...
en: ...when seeing taho in pain was...

source: 네놈도 운명의 소년이구나!!
en: you must also be one of the boys of destiny!

source: 여기는 방송국 방향이 아니지 않아요?
en: ...this isn’t the way to the tv station, is it?

source: 다들 괜찮아?
en: is everyone okay?

source: 털석-
en: flop

source: 누군데 저런 짓을 하는 거냐고!!
en: why is he doing this?!

source: 성인 전에 진작 마법 발현이 됐어야 하는건데..
en: your magical abilities should’ve manifested before you became adults...

source: 타호 너...!
en: taho...?

source: 제주로부터
en: From Jeju

source: 세계적인 아이돌 미드나이트의 빈자리를 대신해 특별게스트를 모셨습니다.
en: we have a special guest to fill in for the world famous idol group, midnight.

source: 사람으로 치면 애기들이야
en: like baby plants.

source: 슈욱
en: swish

source: 전날 꾼 꿈..
en: ...what was the dream...

source: ...내가 아이들 구한 거야?
en: did I... just save the kids?

source: 당신들 정체가 뭐예요?{j}뭘 알아서 우리 아들을 여기로 데려 온 거고
en: who are you people? what information made you bring my son here...{j}

source: 끼이이..
en: creak

source: 컥!!
en: ack!

source: 죄송합니다.{j}제가 설명드릴 수 있는 부분이 아닙니다.
en: I am sorry, but that is not something I could explain.{j}

source: 테러?!{j}왜!!!
en: terrorizes idols?! what for?!{j}

source: 성심껏 노력했습니다만..
en: we tried our best to keep you comfortable.

source: 할 말은 해야지.
en: it’s better to be honest.

source: 슈웅
en: whoosh

source: 그럼 내가 발현을 했고
en: so, if my magic has been manifested...

source: …네가 하는 말이 다 사실인지 어떻게 믿어
en: how do we know you’re not lying?

source: 아무튼 다 빼!!{j}마법도 못하면서 무슨 리드보컬이고 리드댄서야?!
en: no, take them all out!! without magic, it doesn’t matter whether you’re a lead vocalist or a main dancer!!

source: 안 힘들어?
en: aren’t you tired?

source: 아앗!
en: oh!

source: 에그 이쁜 것!!
en: aw... you sweetie pie!!

source: 그래도 무대에 피해 안 끼치게 할게.
en: I promise this won’t affect our performance.

source: 비밀유지 계약서에 서명을 부탁 드리겠습니다.
en: please sign this non-disclosure agreement.

source: ...왜 안돼?
en: but... why not?

source: 마법수련
en: magic training

source: 아?!
en: oh!

source: 솔 씨의 부상으로 많은 팬들이 마음 아파하고 있는데요.
en: I hear that many fans are worried about your injury, soule.

source: 그만해!!
en: stop!

source: 이제 마음을 먹어야 해.
en: I must make up my mind now.

source: 어?{j}아냐, 아무것도.{j}깨워서 미안
en: huh? oh, nothing. sorry I woke you.{j}

source: ...내가 본게 뭐였든 간에 지금은 무대를 망치지 않는 게 제일 중요해.
en: whatever that was, nothing is more important than not messing up the stage right now.

source: 이 감촉!!
en: I remember this feeling!

source: 일어나자마자 문 앞에 사람이 딱 대기하고 있더라?
en: you see, someone was waiting at the door when I woke up.

source: 윗선에 보고하고 오겠습니다.
en: I will report to my supervisor and be right back.

source: 몇 페이지 안 되긴 하지만...
en: although it’s only a few pages...

source: 드디어 찾았다!!!
en: finally... I found him!!!

source: 너희들은?{j}다들 괜찮은 거지?
en: what about you guys? is everyone all right?{j}

source: 만지작
en: fidget

source: 그토록 찾던 소년을 데려가게 됐으니
en: but now that I have the boy we’ve been looking for in my hands...

source: 쑤욱
en: float

source: 꾸벅
en: bow

source: 결국 이렇게 될 일이었어.
en: I knew this would happen.

source: 네가 태어날 때부터
en: ...since the day you were born...

source: 우린 괜찮은데
en: we’re fine,

source: 1군이 됐으니 그에 어울리는 매니저를 갖춰야지
en: you need a manager who befits the tier-one group you are now.

source: 나 이제 마법 쓸 수 있다!!
en: I can use magic now!

source: 직원에게 전달해 두겠습니다.
en: I’ll let the staff know.

source: 공원 10바퀴!
en: ten laps around the park. go!

source: 만약 이걸 내가 쏠 수 있으면!
en: if only I could use this...

source: 음...동물병원은 내가 비켄형이랑 다녀올게.
en: you know what? viken and I will take the cat to the vet.

source: 지금 연락처를 몰라서 여기로 연락해.
en: Leaving a DM because I don’t have your current phone number.

source: 질끈
en: wince

source: 예.{j}감사했습니다.
en: yes, it’s been great. thank you.{j}

source: 솔이는 내가 살펴볼 테니까 넌 다른 애들한테 가봐.
en: I’ll take care of soule. go see if the others are okay.

source: 이런 식으로 나오시겠다?
en: so this is how you want to play it, huh?

source: 규칙이라니?
en: what rules?

source: 다들 오늘 하루 고생 많았어.
en: you all did a great job today.

source: 꽤나 끔찍했지?{j}그거..
en: I bet it was quite excruciating.{j}

source: 안 먹어?
en: you don’t want it?

source: 바,방금 사람을...죽였어?
en: d-did he... just kill someone?

source: 톡-
en: plop

source: 으윽!!
en: ugh!

source: 내가 진짜 열심히 해서 마법 쓸 수 있게 만들게!
en: I’ll practice harder so I can use it anytime anyone needs it!

source: 공유
en: Share

source: 히잉
en: aw, man...

source: 음...
en: hm...

source: 마무리로 공원 15바퀴!
en: let’s wrap it up with 15 laps around the park!

source: 아니, 별거 아냐.
en: it’s nothing.

source: 쿠와와와
en: grrrr

source: 무대 위에서 보여 준 그 기량!
en: ...with your performance on stage!

source: 오늘의 실패엔 반드시
en: you will pay...

source: 뭘 어떻게 하면 되죠?
en: what do we do now?

source: 마법 발현을 하게 해준다는 말에
en: a lot of trainees tried this technique in secret...

source: 뭘 꾸물거려요?
en: come on!

source: ..왜 울고 그래
en: come on, don’t cry...

source: 갑작스레 발현한 마법 덕분에
en: shooting commercials, tv shows, magazine covers, and interviews...

source: 가수 롯으로서 널 지원하는 일은 없을 거다.
en: I won’t support you as lote in any way.

source: 솔이형?
en: soule?

source: 정신 좀 차려봐!
en: wake up, soule!

source: 턱
en: grab

source: 오 좋다. 치킨!!
en: fried chicken sounds good!!

source: 이지?
en: a dream, right?

source: 와아아~
en: wow

source: 왜 그러고 사냐?!{j}나란 놈!!
en: seriously, what’s wrong with you?!{j}

source: ...{j}왜 음악이 안나오지?
en: why isn’t the music playing...?{j}

source: 가만히 있는 건 아니지!
en: I can’t stand back and do nothing!

source: 제 17 화
en: Episode 17

source: 스윽...
en: swish

source: 최종 리허설 들어갑니다!!
en: ready for the final rehearsal?

source: 텁
en: grab

source: 저 혼자만 좋은 기회라면..거절하고 싶어요
en: I don’t want to take opportunities that only benefit me.

source: 괘..괜찮...아
en: I-I’m fine...

source: 다 정리됐으면 이제 돌아간다!
en: let’s head back if you’re all good to go!

source: 파악
en: fwoosh

source: 이계와 중첩된 '매직 아일랜드'가 만들어지고
en: ...which created “magic islands,” or areas superpositioned with the otherworld, around the globe.

source: 그래도 날 막아야겠다면 힘으로라도 막아 보던가.
en: if you must stop me, try me.

source: 다른 아이돌이 올라와 있었습니다.
en: instead of the ones we assumed to be boys of destiny.

source: 그게 무슨 소리야?
en: what are you guys talking about?

source: 으윽!
en: ugh!

source: 너무 신경 써서 그런 꿈을 꾼 걸 거야.
en: I must’ve had a nightmare because of stress.

source: 아직 새벽이야.{j}더 자도 돼.
en: it’s still early. you can go back to sleep.{j}

source: '또 등장한 테러단체, 1군 도망 가는데, 2군이 맞섰다..'
en: In another terrorist attack, Tier-Ones ran for their lives while Tier-Twos fought back...

source: 어째서 우리 아이들을 빼돌리려고 하지?
en: why are you trying to pull our boys out of the field?

source: 아~ 아냐 아냐~
en: oh! no, not at all.

source: 그러려고 했는데...{j}아까 너희들이 하던 얘기
en: I was about to, but... are you going to tell me what you were talking about?{j}

source: 흠…
en: hm...

source: 마법 트레이너라면서 며칠째 마법은 하나도 안 가르쳐 주잖아.
en: he called himself a “magic trainer”, yet he hasn’t taught us anything.

source: 스타일보
en: Star Daily

source: 적당히 처리해야겠지?
en: so I should handle them as I see fit.

source: 운명의 소년?
en: the boys of destiny?

source: 그거 아냐?{j}아이돌 테러한다는!
en: isn’t that the guy who terrorizes idols?!{j}

source: 반야?
en: who’s banya?

source: 유진 형이 얼마나 연습했었는데
en: eugene practiced so hard for it.

source: 와 대박..
en: whoa, he’s dope...

source: 열심히 하려고.
en: yeah, but a friend of mine is rooting for me.

source: 보호자분은 다른 차량을 이용해 주십시오.
en: family members must use a different vehicle, ma’am.

source: 으아!
en: oh, no!

source: 너랑 유진 형이랑 뭔가 관계가 있는 거 아냐?
en: you and eugene did something, didn’t you?

source: 안무도 마법을 잘 보여 줄 수 있게 구성을 다시 짜자고!
en: why don’t we change up the choreography to show off their magic better?

source: 캉
en: clang

source: 그것에 대한 답례라고 생각 하면 돼.{j}숙박비 같은 거랄까?
en: this is my way of saying thank you. consider it as a charge for accommodation.{j}

source: 뭐든 해야 하는 거 아냐?
en: should I do something?

source: 마법을
en: ...and could use magic...

source: 어찌 됐든 가보자.
en: why don’t we check it out?

source: 인과율이구나!!
en: it’s the causality!!

source: 안그래?!!
en: am I right?!
